{
    "class_name": "Model",
    "keras_version": "2.0.6",
    "config": {
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "dtype": "float32",
                    "batch_input_shape": [
                        null,
                        224,
                        224,
                        3
                    ],
                    "name": "input_1",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_1"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "padding": [
                        [
                            3,
                            3
                        ],
                        [
                            3,
                            3
                        ]
                    ],
                    "trainable": true,
                    "name": "zero_padding2d_1",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "conv1",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 64,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        7,
                        7
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn_conv1",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn_conv1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_1"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_1"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_1",
                    "trainable": true,
                    "data_format": "channels_last",
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2a_branch2a",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 64,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2a_branch2a"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2a_branch2a",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2a_branch2a"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_2"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_2"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2a_branch2b",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 64,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2a_branch2b"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2a_branch2b",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2a_branch2b"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_3"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_3"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2a_branch2c",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 256,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2a_branch2c"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2a_branch1",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 256,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2a_branch1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2a_branch2c",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2c",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2a_branch2c"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2a_branch1",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2a_branch1"
            },
            {
                "class_name": "Add",
                "config": {
                    "trainable": true,
                    "name": "add_1"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2c",
                            0,
                            0,
                            {}
                        ],
                        [
                            "bn2a_branch1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "add_1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_4"
                },
                "inbound_nodes": [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_4"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2b_branch2a",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 64,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2b_branch2a"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2b_branch2a",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2b_branch2a"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_5"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2b_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_5"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2b_branch2b",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 64,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2b_branch2b"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2b_branch2b",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2b_branch2b"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_6"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2b_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_6"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2b_branch2c",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 256,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2b_branch2c"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2b_branch2c",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2c",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2b_branch2c"
            },
            {
                "class_name": "Add",
                "config": {
                    "trainable": true,
                    "name": "add_2"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2b_branch2c",
                            0,
                            0,
                            {}
                        ],
                        [
                            "activation_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "add_2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_7"
                },
                "inbound_nodes": [
                    [
                        [
                            "add_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_7"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2c_branch2a",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 64,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2c_branch2a"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2c_branch2a",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2c_branch2a"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_8"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2c_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_8"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2c_branch2b",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 64,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2c_branch2b"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2c_branch2b",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2c_branch2b"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_9"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2c_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_9"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res2c_branch2c",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 256,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res2c_branch2c"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn2c_branch2c",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2c",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2c_branch2c"
            },
            {
                "class_name": "Add",
                "config": {
                    "trainable": true,
                    "name": "add_3"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2c_branch2c",
                            0,
                            0,
                            {}
                        ],
                        [
                            "activation_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "add_3"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_10"
                },
                "inbound_nodes": [
                    [
                        [
                            "add_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_10"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "res3a_branch2a",
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "data_format": "channels_last",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_regularizer": null,
                    "filters": 128,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "use_bias": true,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "res3a_branch2a"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "beta_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "name": "bn3a_branch2a",
                    "epsilon": 0.001,
                    "trainable": true,
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "scale": true,
                    "axis": 3,
                    "gamma_constraint": null,
                    "gamma_regularizer": null,
                    "beta_regularizer": null,
                    "momentum": 0.99,
                    "center": true
                },
                "inbound_nodes": [
                    [
                        [
                            "res3a_branch2a",
